'''
Напишите программу, которая принимает два целых числа и отображает большее из них. Также показать, равны ли два целых числа.

Sample Input 1:
5
7

Sample Output 1:
7

Sample Input 2:
7
7

Sample Output 2:
равны
'''
a = int(input())
b = int(input())
print(a)
print(b)
if a>b:
    print(a)
else:
    print(b)




 